In [170]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [171]:
path = "StudentsPerformance.csv"
df = pd.read_csv(path)

In [172]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [173]:
df.shape

(1000, 8)

In [174]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [175]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [176]:
df.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [177]:
df['test preparation course code'] = df['test preparation course'].str.replace('completed','2').replace('none','1').astype('int')

In [178]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,test preparation course code
0,female,group B,bachelor's degree,standard,none,72,72,74,1
1,female,group C,some college,standard,completed,69,90,88,2
2,female,group B,master's degree,standard,none,90,95,93,1
3,male,group A,associate's degree,free/reduced,none,47,57,44,1
4,male,group C,some college,standard,none,76,78,75,1

In [179]:
df.dtypes

gender                          object
race/ethnicity                  object
parental level of education     object
lunch                           object
test preparation course         object
math score                       int64
reading score                    int64
writing score                    int64
test preparation course code     int32
dtype: object

In [180]:
df['lunch code'] = df['lunch'].str.replace('standard','1').str.replace('free/reduced','2').astype('int')

In [181]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,test preparation course code,lunch code
0,female,group B,bachelor's degree,standard,none,72,72,74,1,1
1,female,group C,some college,standard,completed,69,90,88,2,1
2,female,group B,master's degree,standard,none,90,95,93,1,1
3,male,group A,associate's degree,free/reduced,none,47,57,44,1,2
4,male,group C,some college,standard,none,76,78,75,1,1

In [182]:
df['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

In [183]:
df['groupe code'] = df['race/ethnicity'].str.replace('group A','1').str.replace('group B','2').str.replace('group C','3').str.replace('group D','4').str.replace('group E','5').astype('int')

In [184]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,test preparation course code,lunch code,groupe code
0,female,group B,bachelor's degree,standard,none,72,72,74,1,1,2
1,female,group C,some college,standard,completed,69,90,88,2,1,3
2,female,group B,master's degree,standard,none,90,95,93,1,1,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,1,2,1
4,male,group C,some college,standard,none,76,78,75,1,1,3

In [185]:
df.dtypes

gender                          object
race/ethnicity                  object
parental level of education     object
lunch                           object
test preparation course         object
math score                       int64
reading score                    int64
writing score                    int64
test preparation course code     int32
lunch code                       int32
groupe code                      int32
dtype: object

In [186]:
df['parental level of education'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [187]:
#df['education level code'] = df['parental level of education'].str.replace('bachelor\'s degree','1').str.replace('some college','2').str.replace('master\'s degree','3').str.replace('associate\'s degree','4').str.replace('high school','5').str.replace('some high school','6').astype('int')

Le dataset à maintenant ses différentes colonnes qui ont une équivalence en int, on va pouvoir ainsi utiliser ces colonnes pour les prendres en paramètres. On peut avoir différentes fonctions à trouver. Comme en fonction de quels paramètres on trouve la meilleur note en math ou en lecture ou en écriture

Définissons nos paramètres X et y

In [188]:
#X les features
"""
    Ici on va chercher à savoir quels sont les paramètres qui entrent en compte dans la note de math
"""
X = df[['test preparation course code','lunch code','groupe code']]

#y La target
y = df['math score']

In [189]:
X

     test preparation course code  lunch code  groupe code
0                               1           1            2
1                               2           1            3
2                               1           1            2
3                               1           2            1
4                               1           1            3
..                            ...         ...          ...
995                             2           1            5
996                             1           2            3
997                             2           2            3
998                             2           1            4
999                             1           2            4

[1000 rows x 3 columns]

In [197]:
X_train,X_test,y_train,y_test = train_test_split(X,y, test_size=0.3, random_state=40)

In [198]:
X_train.shape, y_train.shape, X_test.shape, y_test.shape

((700, 3), (700,), (300, 3), (300,))

In [199]:
clf = LinearRegression()

In [200]:
lin = clf.fit(X_train,y_train)

In [201]:
print(lin.coef_)
print(lin.intercept_)

[ 5.73215458 -9.93581615  2.52229957]
64.00151590823755

In [202]:
lin.score(X,y)

0.19440491735386867

Il y a une corrélation faible entre la note de math et le fait de faire une prépra, être à un certain niveau d'étude et faire parti d'un certain groupe ethnique

In [203]:
#X les features
"""
    Ici on va chercher à savoir quels sont les paramètres qui entrent en compte dans la note de lecture
"""
X = df[['test preparation course code','lunch code','groupe code']]

#y La target
y = df['reading score']

In [204]:
X_train,X_test,y_train,y_test = train_test_split(X,y, test_size=0.3, random_state=60)

In [205]:
clf2 = LinearRegression()

In [206]:
lin2 = clf2.fit(X_train,y_train)

In [207]:
print(lin2.coef_)
print(lin2.intercept_)

[ 6.77173951 -6.1408564   1.57421748]
62.87490774412602

In [208]:
lin2.score(X,y)

0.1280441897545047

Il y a une corrélation faible entre la note de math et le fait de faire une prépra, être à un certain niveau d'étude et faire parti d'un certain groupe ethnique

In [209]:
#tentons de retirer le cgroupe ethnique dans les paramètres

X = df[['test preparation course code','lunch code']]

y = df['writing score']

In [210]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=60)

In [211]:
clf3 = LinearRegression()

In [212]:
lin3 = clf3.fit(X_train,y_train)

In [213]:
print(lin3.coef_)
print(lin3.intercept_)

[ 9.59523663 -7.20607931]
64.3951409030953

In [214]:
lin3.score(X,y)

0.15956043639588524